app/controllers/pizzas_controller.rb

    def index
        pizzas = Pizza.all
---
SELECT "pizzas".* FROM "pizzas"