app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @restaurant = Restaurant.find_by(id: params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]
DELETE FROM "restaurant_pizzas" WHERE "restaurant_pizzas"."id" = ?  [["id", 14]]
---
  def destroy
    @restaurant = Restaurant.find_by(id: params[:id])
    if @restaurant
      @restaurant.restaurant_pizzas.destroy_all
      @restaurant.destroy