app/controllers/restaurant_pizzas_controller.rb

INSERT INTO "restaurant_pizzas" ("price", "restaurant_id", "pizza_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["price", 4], ["restaurant_id", 3], ["pizza_id", 2], ["created_at", "2023-03-20 20:20:05.718348"], ["updated_at", "2023-03-20 20:20:05.718348"]]
---
    def create
        restaurant_pizza = RestaurantPizza.new(restaurant_pizza_params)
        if restaurant_pizza.save